[
  {
    "title": " ",
    "content": "This is a register and privacy statement in accordance with the Finnish Personal Data Act (10 and 24 ยง) and the EU General Data Protection Regulation (GDPR). The privacy statement was drafted on May 3, 2023."
  },
  {
    "title": "Register holder",
    "content": "Kai Jukarainen\n\nkai.jukarainen@kaijukarainen.com"
  },
  {
    "title": "Contact person for the register",
    "content": "Kai Jukarainen\n\nkai.jukarainen@kaijukarainen.com"
  },
  {
    "title": "Register name",
    "content": "Kai Jukarainen customer and marketing register"
  },
  {
    "title": "Purpose and legal basis for processing personal data",
    "content": "The legal basis for processing personal data is\n\n- consent of the individual\n- the legitimate interest of the register holder.\n\nThe purpose of processing personal data is to maintain customer relationships, marketing, and communication.\n\nData is not used for automated decision-making or profiling."
  },
  {
    "title": "Content of the register",
    "content": "Information that may be stored in the register includes\n\n- the person's name, company or organization, email, phone number, and IP address\n- Information on ordered services and changes to them.\n- Billing information, other information related to customer relationships and ordered services.\n\nI will process the information for as long as necessary for the purpose of the register's operation."
  },
  {
    "title": "Regular sources of information",
    "content": "The information to be recorded in the register is obtained directly from the individual, for example, during website visits, messages sent via web forms, by email, phone, social media services, agreements, customer meetings, and other situations where the customer provides their information."
  },
  {
    "title": "Regular disclosures of data and transfer of data outside the EU or EEA",
    "content": "Data is not regularly disclosed to parties outside the company, nor is it disclosed for marketing purposes to other parties. Information may be published to the extent agreed upon with the customer.\n\nSome of the external service or software providers used by the company may store information outside the EU or EEA. We use the following third-party services: Google"
  },
  {
    "title": "Principles of register protection",
    "content": "Care is taken in the processing of the register, and the information processed by the information systems is properly protected. Information is transferred over an SSL-protected connection. When register information is stored on Internet servers, the physical and digital security of the hardware is appropriately taken care of. The register holder ensures that the stored information and server usage rights and other information critical to the security of personal data are handled confidentially and only by employees whose job description requires it."
  },
  {
    "title": "Your Rights",
    "content": "Every person registered in the register has the right to:\n\n- inspect the information stored in the register\n- demand correction of any incorrect information or supplementation of incomplete information\n- request the removal of personal data from the register (\"right to be forgotten\")\n\nRegistered persons also have other rights under the EU General Data Protection Regulation, such as limiting the processing of personal data in certain situations. All of the above requests must be submitted in writing to the data controller. If necessary, the data controller may ask the requester to prove their identity. The data controller will respond to the customer within the time limit set out in the EU General Data Protection Regulation (usually within one month)."
  },
  {
    "title": "Cookies Policy",
    "content": "Updated: 3.5.2023\n\nOur website uses cookies. By clicking the \"Accept\" button, you accept the use of cookies (cookie pop-up).\n\nA cookie is a small text file that an Internet browser saves on a user's device when they visit a website. Cookies or other technologies do not harm the user's device or files, and cookies cannot be used to run programs or spread malware.\n\nEssential cookies ensure the technical functionality of the website and are not used for other purposes. The website always uses a secure connection (https). Cookies make using our website easy, fast, and user-friendly.\n\nYou can read more about our cookie policy here:\n\n[HOW GOOGLE USES COOKIES](https://policies.google.com/technologies/cookies)"
  }
]
