[
  {
    "title": " ",
    "content": "Tämä on henkilötietolain (10 ja 24 §) ja EU:n yleisen tietosuoja-asetuksen (GDPR) mukainen rekisteri- ja tietosuojaseloste. Tietosuojaseloste on laadittu 3.5.2023."
  },
  {
    "title": "Rekisterinpitäjä",
    "content": "Kai Jukarainen\n\nkai.jukarainen@kaijukarainen.com"
  },
  {
    "title": "*Rekisteristä vastaava yhteyshenkilö",
    "content": "Kai Jukarainen\n\nkai.jukarainen@kaijukarainen.com"
  },
  {
    "title": "Rekisterin nimi",
    "content": "Kai Jukarainen asiakas- ja markkinointirekisteri"
  },
  {
    "title": "Henkilötietojen käsittelyn tarkoitus ja oikeusperuste",
    "content": "Henkilötietojen käsittelyn oikeusperuste on\n\n- henkilön suostumus\n- rekisterinpitäjän oikeutettu etu.\n\nHenkilötietojen käsittelyn tarkoitus on asiakassuhteen ylläpito, markkinointi ja yhteydenpito.\n\nTietoja ei käytetä automatisoituun päätöksentekoon tai profilointiin."
  },
  {
    "title": "Rekisterin tietosisältö",
    "content": "Rekisteriin tallennettavia tietoja voivat olla\n\n- Henkilön nimi, yritys tai organisaatio, sähköposti , puhelinnumero, verkkoyhteyden IP-osoite\n- Tiedot tilatuista palveluista ja niiden muutoksista.\n- Laskutustiedot, muut asiakassuhteeseen ja tilattuihin palveluihin liittyvät tiedot.\n\nKäsittelen tietoja niin kauan kun se on tarpeellista rekisterin tarkoituksen mukaisessa toiminnassa."
  },
  {
    "title": "Säännönmukaiset tietolähteet",
    "content": "Rekisteriin tallennettavat tiedot saadaan henkilöltä itseltään mm. verkkosivusto vierailun yhteydessä, www-lomakkeilla lähetetyistä viesteistä, sähköpostitse, puhelimitse, sosiaalisen median palvelujen kautta, sopimuksista, asiakastapaamisista ja muista tilanteista, joissa asiakas luovuttaa tietojaan."
  },
  {
    "title": "Tietojen säännönmukaiset luovutukset ja tietojen siirto EU:n tai ETA:n ulkopuolelle",
    "content": "Tietoja ei säännönmukaisesti luovuteta yrityksen ulkopuolelle, eikä niitä luovuteta markkinointitarkoituksiin muille tahoille. Tietoja voidaan julkaista siltä osin kuin niin on sovittu asiakkaan kanssa.\n\nOsa yrityksen käyttämistä ulkopuolisista palvelun- tai ohjelmistontarjoajista saattaa säilyttää tietoja EU:n tai ETA:n ulkopuolella. Käytämme seuraavia kolmannen osapuolen palveluita: Google"
  },
  {
    "title": "Rekisterin suojauksen periaatteet",
    "content": "Rekisterin käsittelyssä noudatetaan huolellisuutta ja tietojärjestelmien avulla käsiteltävät tiedot suojataan asianmukaisesti. Tiedot siirretään SSL-suojatun yhteyden ylitse. Kun rekisteritietoja säilytetään Internet-palvelimilla, niiden laitteiston fyysisestä ja digitaalisesta tietoturvasta huolehditaan asiaankuuluvasti. Rekisterinpitäjä huolehtii siitä, että tallennettuja tietoja sekä palvelimien käyttöoikeuksia ja muita henkilötietojen turvallisuuden kannalta kriittisiä tietoja käsitellään luottamuksellisesti ja vain niiden työntekijöiden toimesta, joiden työnkuvaan se kuuluu."
  },
  {
    "title": "Sinun oikeudet",
    "content": "Jokaisella rekisterissä olevalla henkilöllä on oikeus\n\n- tarkastaa rekisteriin tallennetut tietonsa\n- vaatia mahdollisen virheellisen tiedon korjaamista tai puutteellisen tiedon täydentämistä.\n- pyytää häntä koskevien henkilötietojen poistamiseen rekisteristä (\"oikeus tulla unohdetuksi\")\n\nNiin ikään rekisteröidyillä on muut EU:n yleisen tietosuoja-asetuksen mukaiset oikeudet kuten henkilötietojen käsittelyn rajoittaminen tietyissä tilanteissa. Kaikki edellä mainitut pyynnöt tulee lähettää kirjallisesti rekisterinpitäjälle. Rekisterinpitäjä voi pyytää tarvittaessa pyynnön esittäjää todistamaan henkilöllisyytensä. Rekisterinpitäjä vastaa asiakkaalle EU:n tietosuoja-asetuksessa säädetyssä ajassa (pääsääntöisesti kuukauden kuluessa)."
  },
  {
    "title": "Evästekäytännöt",
    "content": "Päivitetty: 3.5.2023\n\nSivustomme käyttää evästeitä. \"Hyväksyn\" -nappia painamalla hyväksyt evästeiden käytön (evästepopup).\n\nEväste (cookie) on pieni tekstitiedosto, jonka internet-selain tallentaa käyttäjän laitteelle, kun hän vierailee sivustolla. Evästeet tai muut tekniikat eivät vahingoita käyttäjän päätelaitetta tai tiedostoja, eikä evästeitä voi käyttää ohjelmien käyttämiseen tai haittaohjelmien levittämiseen.\n\nVälttämättömien evästeiden avulla varmistetaan verkkosivuston tekninen toimivuus, eikä niitä käytetä muihin tarkoituksiin. Verkkosivusto käyttää aina suojattua yhteyttä (https). Evästeet tekevät sivustomme käyttämisestä helppoa, nopeaa ja käyttäjäystävällistä.\n\nLisätietoa evästekäytännöistä voit lukea täältä:\n\n[MITEN GOOGLE KÄYTTÄÄ EVÄSTEITÄ](https://policies.google.com/technologies/cookies)"
  }
]
